{
  "backend/main.mo": "Main Motoko actor implementing a social media backend with user profiles, posts, likes, comments, stories, notifications, follows, and saved posts, all gated by access control authorization.",
  "feature_evidence.json": "Feature evidence report documenting the rebranding task from 'Devel' to 'Devil India', listing the affected frontend files and associated test/component references.",
  "frontend-file-summaries.txt": "JSON document containing one-to-two sentence summaries of every frontend source file, serving as a reference index for the project's React/TypeScript frontend.",
  "frontend/index.css": "Root CSS file importing Tailwind layers and defining OKLCH-based CSS custom property tokens for light and dark themes including colors, borders, and sidebar variables.",
  "frontend/index.html": "Minimal HTML entry point with the page title set to 'Devil India' and a root div that mounts the React app via main.tsx.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with all app routes, handles authentication gating, shows the Navigation and ProfileSetupModal, and renders the AppLayout with a footer.",
  "frontend/src/components/CommentInput.tsx": "Form component for submitting a new comment on a post, supporting Enter-to-submit, loading state, and using the useAddComment mutation hook.",
  "frontend/src/components/CommentList.tsx": "Renders a list of Comment objects, fetching each author's profile to display their avatar, display name, and relative timestamp alongside the comment text.",
  "frontend/src/components/CreateStoryModal.tsx": "Dialog modal for creating a new story by entering an image URL, with a live preview and submission via the useCreateStory mutation hook.",
  "frontend/src/components/EditProfileModal.tsx": "A modal dialog component that allows authenticated users to edit their display name, bio, and avatar URL, submitting changes via the `useUpdateProfile` mutation hook.",
  "frontend/src/components/FollowButton.tsx": "A button component that toggles follow/unfollow state for a target user, hiding itself when viewing one's own profile or when unauthenticated.",
  "frontend/src/components/Navigation.tsx": "A sticky top navigation bar with links to Home, Explore, New Post, Notifications, Saved, and Profile, conditionally rendering authenticated-only items and handling logout.",
  "frontend/src/components/NotificationBell.tsx": "A navigation link component displaying a bell icon with an unread notification count badge, linking to the notifications page.",
  "frontend/src/components/PostCard.tsx": "A card component that renders a post with author info, image, like/save action buttons, and caption, navigating to the post detail page on click.",
  "frontend/src/components/StoriesBar.tsx": "A horizontal scrollable bar showing story avatars for active users, with an 'Add Story' button for authenticated users and controls to open the story creator or viewer.",
  "frontend/src/components/StoryViewer.tsx": "A fullscreen overlay modal that displays a specific user's stories with progress indicators, navigation arrows, and keyboard controls for cycling through them.",
  "frontend/src/components/UserAvatar.tsx": "A simple avatar image component supporting multiple sizes that falls back to a placeholder image if the provided URL is missing or fails to load.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor using React Query, returning either an authenticated or anonymous actor based on the current Internet Identity, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider component, exposing login/logout functions, identity state, and login status via a React context hook.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend interactions including user profiles, posts, stories, and notifications, wrapping actor calls with caching and mutation invalidation logic.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, configures Tailwind CSS, defines a dark navy/blue OKLCH color palette via CSS variables, and adds custom utility classes for glow effects and scrollbars.",
  "frontend/src/lib/utils.ts": "Utility functions for merging Tailwind class names, formatting nanosecond timestamps as relative time strings, and truncating principal IDs for display.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with React Query and Internet Identity providers.",
  "frontend/src/pages/ExplorePage.tsx": "Explore page with a user search input that displays matching user profiles with follow buttons, and shows all recent posts when no search term is entered.",
  "frontend/src/pages/HomePage.tsx": "Home feed page that shows a personalized feed for authenticated users or recent posts for anonymous visitors, with a stories bar, skeleton loading states, and a new post button.",
  "frontend/src/pages/LandingPage.tsx": "Landing page for Devil India with a hero section, Internet Identity login button, and a three-feature grid highlighting photo sharing, engagement, and community building.",
  "frontend/src/pages/NewPostPage.tsx": "Form page for creating a new post by entering an image URL and caption, with a live image preview and submission via the useCreatePost mutation.",
  "frontend/src/pages/NotificationsPage.tsx": "Displays a list of user notifications (likes, comments, follows) and automatically marks them as read; shows a sign-in prompt for unauthenticated users.",
  "frontend/src/pages/PostDetailPage.tsx": "Detail view for a single post showing the PostCard, a comment list, and a comment input for authenticated users, fetched by post ID from the route params.",
  "frontend/src/pages/ProfilePage.tsx": "User profile page displaying avatar, bio, follower/following stats, and a grid of posts, with an edit button for the current user's own profile.",
  "frontend/src/pages/ProfileSetupModal.tsx": "Modal dialog shown to new users after login to collect a required display name and optional bio, saving the profile via useSaveCallerUserProfile.",
  "frontend/src/pages/SavedPage.tsx": "Displays a grid of bookmarked posts for authenticated users, showing loading skeletons while fetching and an empty state with a browse link if no saved posts exist.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for extracting URL parameters from query strings or hash-based routes, persisting them in sessionStorage, and cleaning sensitive params from the URL bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom fonts (Inter, Space Grotesk), OKLCH-based color tokens (blue, navy, semantic UI colors), border radii, box shadows, and keyframe animations for the app's design system.",
  "project_state.json": "Tracks the overall project state (version 11) for a photo-sharing app called 'Devil India', listing implemented features such as authentication, profiles, posts, feed, likes, comments, follow/unfollow, and theming."
}